itub375/DSP_C/device/startup_S6E2CCAJOA.c
/******************************************************************************
 * @file     startup_S6E2CCAJ0A.c
 * @brief    CMSIS-Core(M) Device Startup File for
 *           Device S6E2CCAJ0A
 * @version  V1.0.0
 * @date     20. January 2021
 ******************************************************************************/
/*
 * Copyright (c) 2009-2021 Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */



#include "s6e2ccxj.h"
#include "system_s6e2cc.h"

/*---------------------------------------------------------------------------
  External References
 *---------------------------------------------------------------------------*/
extern uint32_t __INITIAL_SP;
extern uint32_t __STACK_LIMIT;

extern __NO_RETURN void __PROGRAM_START(void);



/*---------------------------------------------------------------------------
  Internal References
 *---------------------------------------------------------------------------*/
__NO_RETURN void Reset_Handler  (void);
__NO_RETURN void Default_Handler(void);



/*---------------------------------------------------------------------------
  Exception / Interrupt Handler
 *---------------------------------------------------------------------------*/
/* Exceptions */
void NMI_Handler                (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void HardFault_Handler          (void) __attribute__ ((weak));
void MemManage_Handler          (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void BusFault_Handler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void UsageFault_Handler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void SVC_Handler                (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void DebugMon_Handler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void PendSV_Handler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void SysTick_Handler            (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));

/* device specific interrupt handler */
void CSV_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void SWDT_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void LVD_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void IRQ003SEL_IRQHandler       (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void IRQ004SEL_IRQHandler       (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void IRQ005SEL_IRQHandler       (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void IRQ006SEL_IRQHandler       (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void IRQ007SEL_IRQHandler       (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void IRQ008SEL_IRQHandler       (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void IRQ009SEL_IRQHandler       (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void IRQ010SEL_IRQHandler       (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT0_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT1_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT2_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT3_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT4_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT5_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT6_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT7_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void QPRC0_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void QPRC1_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT0_WFG_DTIF_IRQHandler   (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT1_WFG_DTIF_IRQHandler   (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT2_WFG_DTIF_IRQHandler   (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT0_FRT_PEAK_IRQHandler   (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT0_FRT_ZERO_IRQHandler   (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT0_ICU_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT0_OCU_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT1_FRT_PEAK_IRQHandler   (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT1_FRT_ZERO_IRQHandler   (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT1_ICU_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT1_OCU_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT2_FRT_PEAK_IRQHandler   (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT2_FRT_ZERO_IRQHandler   (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT2_ICU_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFT2_OCU_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void PPG00_02_04_IRQHandler     (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void PPG08_10_12_IRQHandler     (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void PPG16_18_20_IRQHandler     (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void BT0_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void BT1_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void BT2_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void BT3_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void BT4_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void BT5_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void BT6_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void BT7_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void DT_IRQHandler              (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void WC_IRQHandler              (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXTBUS_ERR_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void RTC_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT8_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT9_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT10_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT11_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT12_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT13_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT14_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT15_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void TIM_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS0_RX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS0_TX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS1_RX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS1_TX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS2_RX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS2_TX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS3_RX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS3_TX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS4_RX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS4_TX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS5_RX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS5_TX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS6_RX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS6_TX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS7_RX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS7_TX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void ADC0_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void ADC1_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void USB0_F_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void USB0_H_F_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void CAN0_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void CAN1_CANFD0_IRQHandler     (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void ETHER0_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void DMAC0_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void DMAC1_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void DMAC2_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void DMAC3_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void DMAC4_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void DMAC5_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void DMAC6_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void DMAC7_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void DSTC_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT16_19_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT20_23_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT24_27_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void EXINT28_31_IRQHandler      (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void QPRC2_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void QPRC3_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void BT8_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void BT9_IRQHandler             (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void BT10_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void BT11_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void BT12_15_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS8_RX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS8_TX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS9_RX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS9_TX_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS10_RX_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS10_TX_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS11_RX_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS11_TX_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void ADC2_IRQHandler            (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void DSTC_HW_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void USB1_F_IRQHandler          (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void USB1_H_F_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void HSSPI_IRQHandler           (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void PCRC_I2S0_1_IRQHandler     (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void SD_IRQHandler              (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void FLASHIF_IRQHandler         (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS12_RX_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS12_TX_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS13_RX_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS13_TX_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS14_RX_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS14_TX_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS15_RX_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));
void MFS15_TX_IRQHandler        (void) __attribute__ ((weak, alias("Default_Handler"), noreturn));

/*----------------------------------------------------------------------------
  Exception / Interrupt Vector table
 *----------------------------------------------------------------------------*/

#if defined ( __GNUC__ )
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpedantic"
#endif

